package utils;

import java.io.*;
import java.util.regex.Pattern;

/**
 * @Author: youxingyang
 * @date: 2018/3/30 14:50
 */
public final class GenCodeUtil {
    private GenCodeUtil() {
    }

    private static Pattern blank = Pattern.compile("^[//s&&[^//n]]*$");

    public static void main(String[] args) {
        //transferFile("C:\\Users\\domainclient\\Desktop\\src.txt", "C:\\Users\\domainclient\\Desktop\\des.txt");
        //String[] array = {"鼻咽癌","肺癌","胃癌","食管癌","结直肠癌","膀胱癌","胰腺癌","甲状腺癌","肾癌","肝癌","口腔癌","喉癌","慢性淋巴细胞白血病","黑色素瘤","基底细胞癌","脑胶质瘤","脑膜瘤","神经母细胞瘤","鳞状细胞癌","滤泡性淋巴瘤","骨髓增生性肿瘤","腹主动脉瘤","脑动脉瘤","前列腺癌","睾丸癌","乳腺癌","卵巢癌","宫颈癌","子宫内膜癌","霍奇金淋巴瘤","胆囊癌","多发性骨髓瘤","非霍奇金淋巴瘤","急性淋巴细胞白血病","急性髓性白血病","慢性粒细胞白血病","贲门癌","食管鳞状细胞癌","1型糖尿病","2型糖尿病","甲状腺机能减退症","肥胖症","慢性肾病","继发性肾病综合征","特发性膜性肾病","肾结石","牛皮癣","遗传性过敏性皮炎","白癜风","瘢痕瘤","掌腱膜挛缩症","皮肤型硬皮病","麻风病","特应性皮炎","哮喘","慢性阻塞性肺疾病","肺纤维化","肺结核","间质性肺疾病","慢性支气管炎","阿尔兹海默氏症","帕金森","抑郁症","不宁腿综合征","双相型障碍","进行性核上性麻痹","精神分裂症","偏头痛","丛集性头痛","肌萎缩侧索硬化症","酒精依赖症","注意力缺陷多动障碍","强迫性神经障碍","抽动秽语综合征","特发性震颤","发作性睡病","尼古丁依赖","癫痫","晚发性阿尔兹海默氏症","自闭症","系统性红斑狼疮","类风湿关节炎","痛风","白塞氏病综合征","风湿性关节炎","选择性IgA缺陷","干燥综合征","原发性胆汁性肝硬化","多发性硬化症","结节病","川崎病","毒性弥漫性甲状腺肿","风湿性心脏病","疟疾","自身免疫性肝炎","剥脱性青光眼","耳硬化症","过敏性鼻炎","老年性黄斑病变","斑秃","滴状角膜","复发性口腔溃疡","慢性鼻窦炎","青光眼","息肉状脉络膜血管病变","牙周炎","正常眼压性青光眼","溃疡性结肠炎","乳糜泻","胆结石","克罗恩病","酒精性脂肪肝","非酒精性脂肪性肝病","肠易激综合征","慢性乙型肝炎","骨质疏松","强直性脊柱炎","脊柱侧凸","变形性骨炎","骨关节炎","腰椎间盘突出症","腰椎间盘退行性病变","高血压","高血脂","心房颤动","冠心病","脑中风","静脉血栓栓塞","外周动脉病变","心脏性猝死","高胆固醇血症","先天性心脏病","心肌梗死","心力衰竭","原发性高血压","子宫肌瘤","多囊卵巢综合征","子宫内膜异位","妊娠期肝内胆汁淤积症","妊娠糖尿病","男性不育症","2型糖尿病神经病变","2型糖尿病视网膜病变","糖尿病冠心病","糖尿病肾病","糖尿病性白内障","无痛性心肌缺血","非恶性胶质细胞瘤","原发性硬化性胆管炎","冠状动脉粥样硬化"};
        //String[] array = {"苯丙酮尿症","枫糖尿症IB型","胱氨酸尿症","尿黑酸症","组氨酸血症","高肌氨酸血症","3-甲基巴豆酰辅酶A羧化酶缺乏症","α-甲基酰基辅酶A消旋酶缺乏症","肾病型胱氨酸症","非肾病变型胱氨酸症","高脯氨酸血症II型","氨基酰化酶1缺乏","成年发作性瓜氨酸血症II型","新生儿发作性瓜氨酸血症II型","丙酮酸羧化酶缺乏症","赖氨酸尿性蛋白不耐症","酪氨酸血症III型","赖氨酸羟化酶缺乏症3型","二甲基甘氨酸脱氢酶缺乏症","典型枫糖尿症","硫胺有效型枫糖尿症","红细胞谷胱甘肽合成酶缺乏症","非酮症高甘氨酸血症","甘氨酸脑病","丙酸血症","甲基丙二酸尿症cblA型","甲基丙二酸尿症cblB型","尿刊酸水合酶缺乏症","甲基丙二酸尿症CblJ型","高鸟胺酸血症-高氨血症-高瓜胺酸血症候群","糖原累积症IA型","糖原累积症IB型","葡萄糖-6-磷酸脱氢酶缺乏症","先天性糖基化紊乱IA型","遗传性果糖不耐受症","糖原累积症IV型","糖原累积症IIIB型","糖原累积症IIIA型","庞贝氏症","半乳糖血症I型","麦卡德尔病","糖原累积症XIII型","糖原累积症IXB型","糖原累积症X型","糖原累积症XV型","GM1神经节苷脂贮积症I型","糖原累积症0型","先天性糖基化紊乱IIn型","先天性糖基化紊乱IJ型","先天性糖基化紊乱IK型","多葡聚糖体病2型","粘多糖贮积症IH/S型","粘多糖贮积症IIIA型","粘多糖贮积症IS型","粘多糖贮积症IH型","蔗糖酶-异麦芽糖酶缺乏症","家族性高胆固醇血症","戈谢病I型","家族性联合高脂血症","无β-脂蛋白血症","短链酰基辅酶A脱氢酶缺乏症","原发性高脂蛋白血症I型","全身型原发性肉碱缺陷","脑腱性黄瘤症","IIIγ脂肪沉积症","婴儿型肉碱棕榈酰转移酶II缺乏症","晚发型肉碱棕榈酰转移酶II缺乏症","致死新生儿型肉碱棕榈酰转移酶II缺乏症","胆固醇酯沉积病","先天性全身性脂肪营养不良1型","丹吉尔病","戈谢病III型","脂质贮积病","Krabbe病","长链-3-羟基辅酶A脱氢酶缺乏症","尼曼-匹克病A型","IV型粘脂贮积症","α-1抗胰蛋白酶缺乏","二氢嘧啶脱氢酶缺乏症","酪氨酸血症I型","唾液酸沉积症","原发性高草酸尿症II型","中链酰基辅酶A脱氢酶缺乏症","原发性高草酸尿症I型","先天性肾上腺皮质增生症","肝红细胞生成性卟啉病","低碱性磷酸酶血症，婴儿型","低碱性磷酸酶血症，牙齿型","低碱性磷酸酶血症，儿童型","类脂性先天性肾上腺增生症","腺苷琥珀酸酶缺陷","21羟化酶缺乏症","生物素酶缺乏症","先天性胆汁酸合成障碍4型","2-氨基脂肪2-Oxoadipic二酸血症","精氨丁二酸酶缺乏症","羧化全酶合成酶缺乏症","联合丙二酸和甲基丙二酸尿症","高氨血III型","髓过氧化物酶缺乏症","甲羟戊酸尿症","异戊酸血症","丙酮酸脱氢酶α-硫辛酸合成酶缺乏","17α-羟化酶/17，20-碳链裂解酶缺陷症","原发性高草酸尿症III型","纤溶酶原激活物缺乏症I型","伽马转氨酶缺失","半乳糖唾液酸沉积症（婴儿早期）","涎酸酵素缺乏症II型","豆固醇血症","Smith-Lemli-Opitz综合征","骨骼肌糖原升高症","Sandhoff病小儿型","Sandhoff病幼年型","2-甲基丁酰辅酶A脱氢酶缺乏症","三甲基胺尿症","脯氨酸肽酶缺乏症","多诺霍氏综合征","α1-抗胰蛋白酶缺乏症","肌张力障碍1型","肢带型肌营养不良症2E型","肢近端型点状软骨发育不良1型","肢带型肌营养不良症2D型","肢带型肌营养不良症C5型","层黏连蛋白缺陷性先天性肌营养不良","肢带型肌营养不良症2A型","肢带型肌营养不良症2B型","肢带型肌营养不良症5C型","肢带型肌营养不良症2F型","肢带型肌营养不良症2S型","先天性肌无力综合征11型（乙酰胆碱受体）","先天性肌无力综合征12型","先天性肌无力综合征3B型","先天性肌无力综合征4B型","先天性肌无力综合征4C型","先天性肌无力综合征6型","先天性肌无力综合征9型（乙酰胆碱受体）","腺苷脱氢酶缺乏性肌病","Nonaka肌病","Eichsfeld型先天性肌营养不良症","伴先天性精神发育迟缓肌营养不良B3型","包涵体肌病2型","远端型胫前肌肌病","肌原纤维肌病1型","伴眼外肌麻痹的Minicor肌病","致死性多发性翼状胬肉综合征","Usher综合征IF型","Usher综合征IIIA型","彭德莱综合征","常染色体隐性遗传性耳聋1A型","红绿色盲","全色盲症III型","常染色体隐性遗传性耳聋4型","全色盲症II型","全色盲症VI型","全色盲症VII型","莱伯先天性黑内障10型","莱伯先天性黑内障11型","莱伯先天性黑内障12型","莱伯先天性黑内障13型","莱伯先天性黑内障15型","莱伯先天性黑内障2型","莱伯先天性黑内障5型","莱伯先天性黑内障8型","莱伯先天性黑内障9型","视锥-视杆细胞营养不良20型","鱼眼病","扁平角膜2型","角膜营养不良与感音性耳聋","角膜内皮营养不良","小眼球分离症6型","视网膜色素变性XII型","视网膜色素变性XX型","视网膜色素变性LVIII型","视网膜色素变性LIX型","视网膜色素变性XLII型","视网膜色素变性XLV型","斯特格病1型","视网膜色素变性XIV型","蓝锥细胞增强症","先天性静止型夜盲症1C型","额鼻发育不良1型","洛伯病","回旋状脉络膜视网膜萎缩","视网膜营养不良","视网膜色素变性XL型","视网膜色素变性LXXVII型","Usher综合征IB型","家族性凝视麻痹伴脊柱侧凸","共济失调、视网膜色素变性综合征","黄斑角膜营养不良I型","常染色体隐性耳聋12型","常染色体隐性耳聋29型","Usher综合征ID型","Usher综合征IIIB型","口面指综合征XIV型","β型地中海贫血","范可尼贫血互补C群","镰刀型细胞贫血症","凝血因子Ⅺ缺乏症","血色素沉着症1型","凝血因子IX缺乏症","血色素沉着症2A型","先天性红细胞生成异常性贫血II型","红细胞丙酮酸激酶缺乏症","范可尼贫血互补D1群","遗传性血栓性血小板减少性紫癜","范可尼贫血互补J群","硫胺素敏感的巨幼红细胞性贫血综合征","范可尼贫血互补N群","凝血因子V缺乏症","范可尼贫血互补O群","范可尼贫血互补Q群","二氢叶酸还原酶缺乏型巨幼细胞性贫血症","高胆红素血症ROTOR型","前激肽释放酶缺乏症","血小板减少伴桡骨缺失综合征","转铁蛋白缺乏症","遗传性高铁血红蛋白血症2型","高铁血红蛋白症I型","遗传性血栓形成倾向","家族性肥厚性心肌病4型","婴儿动脉钙化2型","左心室发育不全综合征I型","儿茶酚胺敏感性多形性室性心动过速2型","常染色体隐性病窦综合征1型","常染色体隐性遗传性多囊肾病","间质性肾炎","肾病综合征2型","Bartter综合征3型","原发性低镁血症","特发性激素抵抗肾病综合征","交界性大疱性表皮松解症","眼睛皮肤白化症IA型","眼睛皮肤白化症IB型","眼睛皮肤白化症II型","常染色体隐性皮肤松弛症IIB型","少毛症6型","少毛症8型","脓疱性银屑病14型","着色性干皮病E群","海姆-芒克综合征","先天性常染色体隐性鱼鳞病4A型","先天红血球生成卟啉症","着色性干皮病C群","着色性干皮病D群","Leigh综合征法国-加拿大型","泰-萨二氏症","家族性自主神经功能异常","中枢神经系统海绵样变性","伴随周围神经病变胼胝体发育不全症","神经元蜡样质脂褐素沉积病1型","常染色体隐性痉挛性共济失调","家族性淀粉样多发性神经病变","Aicardi-Goutières综合征I型","Aicardi-Goutières综合征III型","Aicardi-Goutières综合征V型","Aicardi-Goutières综合征VI型","常染色体隐性遗传脊髓小脑性共济失调-17","常染色体隐性遗传脊髓小脑性共济失调-11","常染色体隐性遗传脊髓小脑性共济失调-10","常染色体隐性遗传脊髓小脑性共济失调-1","神经元蜡样质脂褐素沉积病2型","早期婴儿型癫痫性脑病10型","先天性多巴胺β-羟化酶缺乏症","常染色体隐性Segawa综合征","Joubert综合征I型","Joubert综合征II型","钼辅因子缺乏症A型","腓骨肌萎缩症4C型","舞蹈病-棘红细胞增多症","Joubert综合征III型","Joubert综合征V型","Joubert综合征VI型","Joubert综合征VII型","Joubert综合征VIII型","Joubert综合征XIV型","Joubert综合征XVI型","Joubert综合征XXI型","Joubert综合征XXIII型","Joubert综合征XXVI型","髓鞘发育不良性脑白质营养不良7型","脱髓鞘病变","常染色体隐性痉挛性截瘫11型","致死性先天性挛缩综合征1型","Perry综合征","家族性婴儿肌阵挛性癫痫","磷酸甘油酸脱氢酶缺乏症","共济失调型白质脑病","白质消融性白质脑病","吡哆醇依赖性癫痫","进行性肌阵挛癫痫5型","傍癫痫性多小脑回畸形","桥新小脑发育不全1B型","先天性脑桥小脑发育不全2A型","Lafora病","常染色体隐性痉挛性截瘫5A型","远端脊髓型肌萎缩1型","常染色体隐性痉挛性截瘫7型","伴脊髓与脑干受累以及脑白质乳酸升高的脑白质病","伴皮层下囊肿的巨脑性白质脑病1型","婴儿型GM1神经节苷脂沉积症","婴儿型上升性遗传性痉挛性麻痹","泛酸激酶相关神经变性","婴幼儿神经轴突营养不良","异染性脑白质营养不良，青少年型","异染性脑白质营养不良，严重型","异染性脑白质营养不良，晚婴型","进行性肌阵挛癫痫Unverricht-Lundborg型","Sandhoff病婴儿型","Sandhoff病青年型","Sandhoff病成人型","进行性肌阵挛癫痫伴共济失调综合征","常染色体隐性轴突神经病变伴随声带麻痹","异染性脑白质营养不良，温和型","遗传性感觉和自主神经障碍型IIB","辛德勒病I型","布卢姆综合征","家族性地中海热","囊性纤维化","脑肝肾综合征","Sjögren-Larsson综合征","常染色体隐性遗传先天性角化不良IV型","常染色体隐性遗传先天性角化不良III型","常染色体隐性遗传先天性角化不良V型","肠病性肢端皮炎","AAA综合征","动脉迂曲综合征","Bardet-Biedl综合征XIII型","高锰血症伴肌张力障碍，红细胞增多和肝硬化","Donnai-Barrow综合征","Senior-Loken综合征5型","伴钙化和囊变的脑视网膜微血管病","Senior-Loken综合征8型","多种硫酸酯酶缺乏症","Coach综合征","颅骨外胚层发育不良1型","颅骨外胚层发育不良2型","间质性肺和肝脏疾病","Bardet-Biedl综合征I型","马吉德综合征","外胚层发育不良4型","Ehlers-Danlos综合征1型（早衰型）","Ehlers-Danlos综合征1型（肌挛缩型）","过氧化物酶体合成障碍5A型","尼曼-匹克病B型","Bardet-Biedl综合征VI型","麦克尔综合征1型","Ehlers-Danlos综合征VI型","Kartagener综合征","多囊肾多囊肝","弹性假黄瘤","Hermansky-Pudlak综合征1型","Hermansky-Pudlak综合征3型","GRACILE综合征","肌-眼-脑病","Baraitser-Winter综合征II型","Seckel综合征7型","Rothmund-Thomson综合征","Meckel-Gruber综合征","生长迟缓-发育迟缓-面部畸形综合征","Miller综合征","原发性小头畸形III型","原发性常染色体隐性遗传性小头畸形5型","原发性小头畸形IX型","家族性腺瘤性息肉病2型","MYH相关性息肉病","骨畸形性发育不良","骨发育不全症II型","多发性骨骺发育不良4型","Bruck综合征2型","Schimke免疫-骨发育不良","常染色体隐性遗传性低磷性佝偻病II型","Desbuquois综合征","Meier-Gorlin综合症1型","Meier-Gorlin综合症4型","3M综合征1型","短肋胸廓发育不良3型","额骨干骺端发育不良","维生素D缺乏性佝偻病IB型","短肋-多指综合征5型","脊椎干骺端发育不良Pakistani型","儿童型低磷酸酯酶症","手足裂畸形6型","肺表面活性物质代谢障碍1型","肺泡微结石症","原发性纤毛运动障碍XXIV型","贾兰综合征I型","家族性低钾血低镁血症","常染色体隐性遗传细胞色素b阳性慢性肉芽肿病II型","常染色体隐性遗传细胞色素b阳性慢性肉芽肿病I型","高免疫球蛋白D血症伴有周期性发热","伴肉芽肿结合细胞和体液免疫缺陷","补体成分8缺乏症II型","ICF综合征II型","Omenn综合征","家族性嗜血细胞综合征5型","Hennekam综合征（淋巴管扩张淋巴水肿）","巨大淋巴结增生症","家族性噬血细胞综合征2型","常染色体隐性遗传假性醛固酮减少症1型","性腺功能减退症XI型","芳香化酶缺陷症","性腺功能减退症VII型","先天性甲状腺功能减退症I型","Mitchell-Riley综合征","Pierson综合征","甲状腺激素合成障碍1型","甲状腺激素合成障碍4型","甲状腺激素合成障碍6型","碘化酪氨酸偶联缺陷","Wolcott-Rallison综合征","继发性甲减","类脂蛋白沉积症","甲状腺激素代谢异常","线粒体复合物V缺乏症2型","线粒体DNA缺失综合症2型","线粒体三官能团蛋白质缺乏症","联合氧化磷酸化缺陷1型","联合氧化磷酸化缺陷10型","联合氧化磷酸化缺陷5型","联合氧化磷酸化缺陷8型","多线粒体功能障碍综合征1型","佩罗综合征4型","胰腺外分泌功能不全-红细胞生成障碍性贫血-颅骨骨质增生","感觉性共济失调神经病变-构音障碍-眼肌麻痹","遗传性肌病乳酸性酸中毒","线状体肌病8型","线粒体复合体III缺乏症","Crigler-Najjar综合征I型","Dubin-Johnson综合征","短暂性婴儿肝衰竭","多发性肠闭锁","Mabry综合征I型","Marinesco-Sjogren综合征","精神发育迟滞15型","精神发育迟滞34型"};
        //String[] array = {"二膦酸盐","利塞膦酸盐","曲格列酮","二甲双胍","安非他酮","胰岛素增敏剂","依替膦酸","瑞格列奈","格列本脲","他克莫司","阿巴卡韦","麦考酚酸酯","丙磺舒","硫唑嘌呤","霉酚酸","依法韦仑","琥珀酰胆碱","他汀类药物","华法林","卡维地洛","布新洛尔","硫酸氢氯吡格雷","维拉帕米","血管紧张素转化酶抑制剂","醋硝香豆醇","阿替洛尔","阿托伐他汀","美托洛尔","别嘌呤醇","酞醚哌啶酮","氟氯青霉素","利福平","异烟肼","SSRI类抗抑郁药","利培酮","奥氮平","帕罗西汀","西酞普兰","锂盐","阿米替林","地昔帕明","去甲替林","舍曲林","奋乃静","氟伏沙明","依他普仑","丙咪嗪","丙戊酸","多虑平","氯氮平","氯米帕明","文拉法辛","伊潘立酮","他莫昔芬","卡波铂","吉西他滨","多西他奇","巯基嘌呤甲基转移酶活性","氟尿嘧啶","甲氨喋呤","硫嘌呤甲基转移酶活性","紫杉醇","阿霉素","顺铂","环磷酰胺","伊立替康","奥沙利铂","卡培他滨","巯嘌呤","奥美拉唑","兰索拉唑","雷贝拉唑","柳氮磺胺吡啶","泮托拉唑","卡马西平","苯妥英","奥卡西平","可待因","美沙酮","哌醋甲酯","七氟醚","曲马多","托莫西汀","镇痛剂","阿司匹林","布洛芬","罗非考昔","昂丹司琼","羟考酮","塞来昔布","海洛因依赖性","孟鲁司特","支气管扩张剂","右美沙芬","安体舒通","辛伐他汀","纤溶酶原激活物抑制剂","醋硝香豆素","硫鸟嘌呤","氯吡格雷","纳曲酮","双硫醒","氨苯砜","伯氨喹","阿扎那韦","聚乙二醇干扰素α-2b","奈韦拉平"};
        String[] array = {"维生素A","维生素B12","维生素D","维生素E","叶酸","维生素B6","维生素K","维生素B2","维生素B3","钙","铁","钾","锌","镁","钠","硒","蛋白质","脂类","碳水化合物","乳糖","茶多酚","咖啡因","番茄红素","酒精","乙醇代谢能力","喝酒脸红","DHA","Ω-3脂肪酸","胆碱补充","低GI膳食需求","膳食纤维","注意力","记忆力","阅读能力","避错倾向","学习能力","自律能力","近视风险","高度近视风险","数学敏感度","音乐分辨能力","创造能力","语言表达能力","人际交往亲和度","前列腺特异性抗原水平","C反应蛋白水平","假性胆碱酯酶体内水平","高密度脂蛋白胆固醇水平","脂联素水平","结核病易感性","麻风病易感性","抗诺如病毒能力","抗艾滋病毒能力","抗疟疾能力","疟疾抗药性","疟疾并发症","口腔溃疡易感性","幽门螺旋杆菌易感性","端粒长度","耐力","爆发力","有氧运动","无氧运动","恢复能力","代谢能力","运动对糖尿病的帮助","前交叉韧带断裂的风险","跟腱受伤风险","受伤保护","运动积极性","训练效果","身高","乳房大小","自身IQ受母乳的影响","手指长度比","牙齿生长速度","耳垢类型","更年期时间","初潮时间","脱发风险","抗衰老的能力","饱腹感","摄食欲望","燃脂能力","节食减肥效果","运动减肥效果","卡路里摄入对肥胖的影响","单不饱和脂肪酸对减肥的帮助","饱和脂肪酸对肥胖的影响","体重水平","长雀斑的可能性","卷发","青春痘风险","发量","晒黑风险","皮肤炎症","紫外线过敏风险","胶原蛋白降解速度","鼻头大小","战士基因","苦味敏感度","甜味敏感度","咸味敏感度","气味识别能力","疼痛的敏感度","对咀嚼声音的敏感度","夜猫子","用手偏好","烟瘾","见光喷嚏","甜味喜好","咖啡因依赖","香菜喜好","利他主义","单身基因","抗寒能力"};
        transfer(array);
    }

    /**
     * <result column="serial_number" property="serialNumber"/>
     * ->     a.serial_number
     *
     * @param src    xml里定义的集合resultMap
     * @param start  截取字符头   保证唯一
     * @param end    截取字符尾   保证唯一
     * @param prefix 结果前缀
     * @return a.serial_number
     */
    public static String formatSelectContent(String src, String start, String end, String prefix) {
        if (CommUtil.isEmpty(src) || CommUtil.isEmpty(start) || CommUtil.isEmpty(end) || prefix == null || !src.contains(start) || !src.contains(end)) {
            return "";
        }
        return prefix + src.substring(src.indexOf(start) + start.length(), src.lastIndexOf(end));
    }

    /**
     * 转换show -> info
     *
     * @param src
     * @param des
     */
    public static void transferFile(String src, String des) {
        File file = new File(src);
        if (!file.exists()) {
            return;
        }
        StringBuilder sb = new StringBuilder("");
        //read and transfer
        BufferedReader reader = null;
        try {
            reader = new BufferedReader(new InputStreamReader(new FileInputStream(file), "utf-8"));
            String line;
            while (reader.ready()) {
                line = reader.readLine();
                if (!blank.matcher(line).find()) {
                    String newLine = formatSelectContent(line, "column=\"", "\" ", "a.");
                    if (!"".equals(newLine)) {
                        newLine += ",";
                        sb.append(newLine).append("\n");
                    }
                }
            }
        } catch (Exception e) {
            e.printStackTrace();
        } finally {
            if (reader != null) {
                try {
                    reader.close();
                } catch (IOException e) {
                    e.printStackTrace();
                }
            }
        }

        File desFile = new File(des);
        if (desFile.exists()) {
            if (desFile.delete()) {
                System.out.println(desFile.getAbsolutePath() + " is deleted");
            }
        }
        if (FileUtil.createFile(des)) {
            //write
            BufferedWriter bw = null;
            try {
                bw = new BufferedWriter(new OutputStreamWriter(new FileOutputStream(desFile), "utf-8"));
                bw.write(sb.toString());
            } catch (IOException e) {
                e.printStackTrace();
            } finally {
                if (bw != null) {
                    try {
                        bw.close();
                    } catch (IOException e) {
                        e.printStackTrace();
                    }
                }
            }
        }
    }

    /**
     * {"鼻咽癌", "肺癌"} ->
     * <label class="checkbox-inline">
     <input type="checkbox" id="checkbox1" value="option1"> 鼻咽癌
     </label>
     <label class="checkbox-inline">
     <input type="checkbox" id="checkbox2" value="option2"> 肺癌
     </label>
     * @param array
     */
    public static void transfer(String[] array) {
        StringBuffer sb = new StringBuffer("");
        String start = "<label class=\"checkbox-inline\">";
        String end = "</label>";
        for (int i = 0; i < array.length; i++) {
            sb.append(start).append("\n");
            sb.append("\t").append("<input type=\"checkbox\" id=\"").append(array[i])
                    .append("\" ").append("name=\"checkboxName")
                    .append("\" value=\"").append(array[i]).append("\"> ").append(array[i]).append("\n");
            sb.append(end).append("\n");
        }
        System.out.println(sb.toString());
    }
}
